app/controllers/posts_controller.rb

def create
  @post = current_user.posts.build(post_params)   # used to be =Post.new(post_params)

  if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "This should have a user ID"], ["body", "woowowoowowowowo"], ["created_at", "2018-06-04 12:14:40.447383"], ["updated_at", "2018-06-04 12:14:40.447383"], ["user_id", 1]]